let citydiv = document.getElementById("citiesDiv");

let gradovi = ["Велес", "Демир Капија","Кавадарци", "Неготино","Свети Николе", "Берово","Виница", "Кочани","М. Каменица", "Пехчево","Пробиштип", "Штип","Дебар", "Кичево", "Македонски Брод", "Охрид","Струга", "Богданци","Валандово", "Гевгелија", "Дојран","Радовиш", "Струмица","Битола", "Демир Хисар","Крушево", "Прилеп","Ресен", "Гостивар","Тетово", "Кратово","Крива Паланка", "Куманово","Скопје", "Маврово"];

let i = 0;

function cityButton () {
    for (const item of gradovi) {
        i++;
        citydiv.innerHTML+= `<button class="btn cityBtn" id="city${i}">${item}</button>`
    }
}

cityButton()